Repository: lanmgjy/klipper-translations
Catalog: locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: fr

source: `SHAPER_CALIBRATE` command can be also used to re-calibrate the input shaper in the future, especially if some changes to the printer that can affect its kinematics are made. One can either re-run the full calibration using `SHAPER_CALIBRATE` command, or restrict the auto-calibration to a single axis by supplying `AXIS=` parameter, like
fr: La commande `SHAPER_CALIBRATE` peut également être utilisée pour recalibrer le formateur d'entrée ultérieurement, en particulier si des modifications de l'imprimante pouvant affecter sa cinématique sont apportées. On peut soit relancer l'étalonnage complet à l'aide de la commande `SHAPER_CALIBRATE`, soit restreindre l'auto-étalonnage à un seul axe en fournissant le paramètre `AXIS=`, comme

source: Also, due to some noise in measurements, it is possible that the tuning results will be slightly different from one calibration run to another one. Still, it is not expected that the noise will affect the print quality too much. However, it is still advised to double-check the suggested parameters, and print some test prints before using them to confirm they are good.
fr: De plus, en raison d'un certain bruit dans les mesures, il est possible que les résultats de réglage soient légèrement différents d'un calibrage à l'autre. Ce bruit ne devrait pas trop affecter la qualité d'impression. Cependant, il est conseillé de revérifier les paramètres suggérés et d'imprimer des tests d'impression avant de les utiliser pour confirmer qu'ils sont corrects.

source: Offline processing of the accelerometer data
fr: Traitement hors ligne des données de l’accéléromètre

source: It is possible to generate the raw accelerometer data and process it offline (e.g. on a host machine), for example to find resonances. In order to do so, run the following commands via Octoprint terminal:
fr: Il est possible de générer les données brutes de l’accéléromètre et de les traiter hors ligne (par exemple sur une machine hôte), par exemple pour trouver des résonances. Pour ce faire, exécutez les commandes suivantes via le terminal Octoprint :

source: ignoring any errors for `SET_INPUT_SHAPER` command. For `TEST_RESONANCES` command, specify the desired test axis. The raw data will be written into `/tmp` directory on the RPi.
fr: ignorez toute erreur pour la commande `SET_INPUT_SHAPER`. Pour la commande `TEST_RESONANCES`, spécifiez l’axe de test souhaité. Les données brutes seront écrites dans le répertoire `/tmp` sur le RPi.

source: The data can be processed later by the following scripts: `scripts/graph_accelerometer.py` and `scripts/calibrate_shaper.py`. Both of them accept one or several raw csv files as the input depending on the mode. The graph_accelerometer.py script supports several modes of operation:
fr: Les données peuvent être traitées ultérieurement avec les scripts suivants : `scripts/graph_accelerometer.py` et `scripts/calibrate_shaper.py`. Les deux acceptent un ou plusieurs fichiers csv bruts comme entrée en fonction du mode. Le script graph_accelerometer.py prend en charge plusieurs modes de fonctionnement :

source: plotting raw accelerometer data (use `-r` parameter), only 1 input is supported;
fr: pour le traçage des données brutes de l’accéléromètre (utilisez le paramètre `-r`), seule 1 entrée est prise en charge ;

source: plotting a frequency response (no extra parameters required), if multiple inputs are specified, the average frequency response is computed;
fr: tracer une réponse en fréquence (aucun paramètre supplémentaire n'est requis), si plusieurs entrées sont spécifiées, la réponse en fréquence moyenne est calculée ;

source: comparison of the frequency response between several inputs (use `-c` parameter); you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used);
fr: comparaison de la réponse en fréquence entre plusieurs entrées (utiliser le paramètre `-c`) ; vous pouvez également spécifier l’axe de l’accéléromètre à prendre en compte via le paramètre `-a x`, `-a y` ou `-a z` (si aucun n’est spécifié, la somme des vibrations pour tous les axes est utilisée) ;

source: plotting the spectrogram (use `-s` parameter), only 1 input is supported; you can additionally specify which accelerometer axis to consider via `-a x`, `-a y` or `-a z` parameter (if none specified, the sum of vibrations for all axes is used).
fr: traçage du spectrogramme (utiliser le paramètre `-s`), seule 1 entrée est prise en charge ; vous pouvez également spécifier l’axe de l’accéléromètre à prendre en compte via le paramètre `-a x`, `-a y` ou `-a z` (si aucun n’est spécifié, la somme des vibrations pour tous les axes est utilisée).

source: Note that graph_accelerometer.py script supports only the raw_data\*.csv files and not resonances\*.csv or calibration_data\*.csv files.
fr: Notez que graph_accelerometer.py script ne prend en charge que les fichiers raw_data\*.csv et non les fichiers resonances\*.csv ou calibration_data\*.csv.

source: For example,
fr: Par exemple,

source: will plot the comparison of several `/tmp/raw_data_x_*.csv` files for Z axis to `/tmp/resonances_x.png` file.
fr: tracera la comparaison de plusieurs fichiers `/tmp/raw_data_x_*.csv` pour l’axe Z dans le fichier `/tmp/resonances_x.png`.

source: The shaper_calibrate.py script accepts 1 or several inputs and can run automatic tuning of the input shaper and suggest the best parameters that work well for all provided inputs. It prints the suggested parameters to the console, and can additionally generate the chart if `-o output.png` parameter is provided, or the CSV file if `-c output.csv` parameter is specified.
fr: Le script shaper_calibrate.py accepte 1 ou plusieurs entrées et peut exécuter le réglage automatique de l'input shaper et suggérer les meilleurs paramètres pour les entrées fournies. Il affiche les paramètres suggérés sur la console et peut en outre générer un graphique si le paramètre `-o output.png` est fourni, ou un fichier CSV si le paramètre `-c output.csv` est spécifié.

source: Providing several inputs to shaper_calibrate.py script can be useful if running some advanced tuning of the input shapers, for example:
fr: Fournir plusieurs entrées à shaper_calibrate.py script peut être utile si vous exécutez un réglage avancé de l'input shaper, par exemple :

source: Running `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (and `Y` axis) for a single axis twice on a bed slinger printer with the accelerometer attached to the toolhead the first time, and the accelerometer attached to the bed the second time in order to detect axes cross-resonances and attempt to cancel them with input shapers.
fr: Exécutez `TEST_RESONANCES AXIS=X OUTPUT=raw_data` (et `Y` axe) pour un seul axe deux fois sur une imprimante cartésienne avec l’accéléromètre fixé à la tête d’outil la première fois, et l’accéléromètre fixé au lit la deuxième fois afin de détecter les résonances croisées des axes et de tenter de les annuler avec l'input shaper.

source: Running `TEST_RESONANCES AXIS=Y OUTPUT=raw_data` twice on a bed slinger with a glass bed and a magnetic surfaces (which is lighter) to find the input shaper parameters that work well for any print surface configuration.
fr: Exécutez `TEST_RESONANCES AXIS=Y OUTPUT=raw_data` deux fois sur le lit avec un lit en verre et une surface magnétique (plus légère) pour trouver les paramètres d'input shaper qui fonctionnent bien pour n’importe quelle configuration de surface d’impression.

source: Combining the resonance data from multiple test points.
fr: Combinaison des données de résonance de plusieurs points de test.

source: Combining the resonance data from 2 axis (e.g. on a bed slinger printer to configure X-axis input_shaper from both X and Y axes resonances to cancel vibrations of the *bed* in case the nozzle 'catches' a print when moving in X axis direction).
fr: Combinaison des données de résonance à partir de 2 axes (par exemple, sur une imprimante cartésienne pour configurer les input_shaper de l’axe X à partir des résonances des axes X et Y pour annuler les vibrations du lit * * au cas où la buse « attraperait » une impression lors du déplacement dans la direction de l’axe X).

source: [input_shaper] shaper_freq_x: ... shaper_type_x: ... shaper_freq_y: 34.6 shaper_type_y: mzv [printer] max_accel: 3000 # should not exceed the estimated max_accel for X and Y axes
fr: [input_shaper] shaper_freq_x: ... shaper_type_x: ... shaper_freq_y: 34.6 shaper_type_y: mzv [printer] max_accel: 3000 # Ne devrait pas dépasser les valeurs estimées d'accélération calculées pour les axes X et Y

source: [adxl345 hotend] # Assuming `hotend` chip is connected to an RPi cs_pin: rpi:None [adxl345 bed] # Assuming `bed` chip is connected to a printer MCU board cs_pin: ... # Printer board SPI chip select (CS) pin [resonance_tester] # Assuming the typical setup of the bed slinger printer accel_chip_x: adxl345 hotend accel_chip_y: adxl345 bed probe_points: ...
fr: [adxl345 hotend] # En considérant que l'adxl de la tête connectée au RPI cs_pin: rpi:None [adxl345 bed] # En considérant que l'adxl du lit est connecté au MCU cs_pin: ... # Printer board SPI chip select (CS) pin [resonance_tester] # En considérant un montage standard pour une imprimante cartésienne accel_chip_x: adxl345 hotend accel_chip_y: adxl345 bed probe_points: ...

source: [resonance_tester] accel_chip: ... probe_points: ... max_smoothing: 0.25 # an example
fr: [resonance_tester] accel_chip: ... probe_points: ... max_smoothing: 0.25 # valeur exemple

source: Testing custom axes
fr: Test des axes personnalisés

source: `TEST_RESONANCES` command supports custom axes. While this is not really useful for input shaper calibration, it can be used to study printer resonances in-depth and to check, for example, belt tension.
fr: la commande ` TEST_RESONANCES` prend en charge les axes personnalisés. Bien que cela ne soit pas vraiment utile pour l’étalonnage des input shaper, cela peut être utilisé pour étudier en profondeur les résonances de l’imprimante et vérifier, par exemple, la tension de la courroie.

source: To check the belt tension on CoreXY printers, execute
fr: Pour vérifier la tension de la courroie sur les imprimantes CoreXY, exécutez

source: and use `graph_accelerometer.py` to process the generated files, e.g.
fr: et utilisez `graph_accelerometer.py` pour traiter les fichiers générés.

source: which will generate `/tmp/resonances.png` comparing the resonances.
fr: qui générera `/tmp/résonances.png` en comparant les résonances.

source: For Delta printers with the default tower placement (tower A ~= 210 degrees, B ~= 330 degrees, and C ~= 90 degrees), execute
fr: Pour les imprimantes Delta avec le placement des tours par défaut (tour A ~= 210 degrés, B ~= 330 degrés et C ~= 90 degrés), exécutez

source: and then use the same command
fr: puis utilisez la même commande

source: to generate `/tmp/resonances.png` comparing the resonances.
fr: pour générer le fichier de comparaison des résonnances `/tmp/résonances.png`.

source: When sourcing ADXL345, be aware that there is a variety of different PCB board designs and different clones of them. Make sure that the board supports SPI mode (small number of boards appear to be hard-configured for I2C by pulling SDO to GND), and, if it is going to be connected to a 5V printer MCU, that it has a voltage regulator and a level shifter.
fr: Lors de l’approvisionnement en ADXL345, sachez qu’il existe une variété de conceptions de cartes PCB différentes et différents clones. Assurez-vous que la carte prend en charge le mode SPI (un petit nombre de cartes semble être configurée en dur pour I2C avec SDO raccordé au GND) et, si elle doit être connectée à un microcontrôleur d’imprimante 5V, qu’elle dispose d’un régulateur de tension et d’un décalage de niveau.

source: [mcu rpi] serial: /tmp/klipper_host_mcu [adxl345] cs_pin: rpi:None [resonance_tester] accel_chip: adxl345 probe_points: 100, 100, 20 # an example
fr: [mcu rpi] serial: /tmp/klipper_host_mcu [adxl345] cs_pin: rpi:None [resonance_tester] accel_chip: adxl345 probe_points: 100, 100, 20 # valeur exemple

source: This will generate 2 CSV files (`/tmp/resonances_x_*.csv` and `/tmp/resonances_y_*.csv`). These files can be processed with the stand-alone script on a Raspberry Pi. To do that, run the following commands:
fr: Cela générera 2 fichiers CSV (`/tmp/resonances_x_*.csv` et `/tmp/resonances_y_*.csv`). Ces fichiers peuvent être traités avec le script autonome sur un Raspberry Pi. Pour ce faire, exécutez les commandes suivantes :

source: The raw data can also be obtained by running the command `ACCELEROMETER_MEASURE` command twice during some normal printer activity - first to start the measurements, and then to stop them and write the output file. Refer to [G-Codes](G-Codes.md#adxl345) for more details.
fr: Les données brutes peuvent également être obtenues en exécutant la commande `ACCELEROMETER_MEASURE` deux fois - d’abord pour démarrer les mesures, puis pour les arrêter et écrire le fichier de sortie. Reportez-vous à [G-Codes](G-Codes.md#adxl345) pour plus de détails.

source: MPU-9250 pin
fr: brochage du MPU-9250

source: Note that resonance measurements and shaper auto-calibration require additional software dependencies not installed by default. First, run on your Raspberry Pi the following commands:
fr: Notez que les mesures de résonance et l’auto-étalonnage de l'input shaper nécessitent des dépendances logicielles supplémentaires non installées par défaut. Tout d’abord, exécutez sur votre Raspberry Pi les commandes suivantes :

source: Next, in order to install NumPy in the Klipper environment, run the command:
fr: Ensuite, pour installer NumPy dans l’environnement Klipper, exécutez la commande :

source: Note that, depending on the performance of the CPU, it may take *a lot* of time, up to 10-20 minutes. Be patient and wait for the completion of the installation. On some occasions, if the board has too little RAM the installation may fail and you will need to enable swap.
fr: Selon les performances du processeur, cette opération peut prendre jusqu’à 20 minutes. Soyez patient et attendez la fin de l’installation. Dans certains cas, si la carte a trop peu de mémoire, l’installation peut échouer et vous devrez activer le fichier d’échange.

source: [mcu rpi] serial: /tmp/klipper_host_mcu [mpu9250] i2c_mcu: rpi i2c_bus: i2c.1 [resonance_tester] accel_chip: mpu9250 probe_points: 100, 100, 20 # an example
fr: [mcu rpi] serial: /tmp/klipper_host_mcu [mpu9250] i2c_mcu: rpi i2c_bus: i2c.1 [resonance_tester] accel_chip: mpu9250 probe_points: 100, 100, 20 # valeurs exemple

source: Connect ethernet cable shielding to the controller board/RPI ground.
fr: Connectez le blindage du câble Ethernet à la terre de la carte contrôleur/RPI.

source: ***Double-check your wiring before powering up to prevent damaging your MCU/Raspberry Pi or the accelerometer.***
fr: ***Vérifiez votre câblage avant de mettre sous tension pour éviter d'endommager votre MCU/Raspberry Pi ou l'accéléromètre ou les deux.***

source: SPI Accelerometers
fr: Accéléromètres SPI

source: Suggested twisted pair order:
fr: Suggestions d'utilisation des paires torsadées :

source: I2C Accelerometers
fr: Accéléromètres I2C

source: Alternatives to the ADXL345 are MPU-9250/MPU-9255/MPU-6515/MPU-6050/MPU-6500. These accelerometers have been tested to work over I2C on the RPi or RP2040(pico) at 400kbaud.
fr: Les alternatives à l'ADXL345 sont MPU-9250, MPU-9255, MPU-6515, MPU-6050 ou MPU-6500. Ces accéléromètres ont été testés pour fonctionner sur I2C avec un RPi ou un RP2040(pico) à 400kbaud.

source: Recommended connection scheme for I2C on the Raspberry Pi:
fr: Schéma de connexion recommandé pour I2C sur le Raspberry Pi :

source: ![MPU-9250 connected to RPI](img/mpu9250-PI-fritzing.png)
fr: ![MPU-9250 connecté au RPI](img/mpu9250-PI-fritzing.png)

source: Recommended connection scheme for I2C(i2c0a) on the RP2040:
fr: Schéma de connexion recommandé pour I2C(i2c0a) connecté au RP2040 :

source: RP2040 pin
fr: Broche du RP2040

source: ![MPU-9250 connected to PICO](img/mpu9250-PICO-fritzing.png)
fr: ![MPU-9250 branché au PICO](img/mpu9250-PICO-fritzing.png)

source: Configure ADXL345 With RPi
fr: Configurer l'ADXL345 avec le RPi

source: Add the following to the printer.cfg file:
fr: Ajoutez les lignes suivantes au fichier printer.cfg :

source: Configure MPU-6000/9000 series With RPi
fr: Configurer les séries MPU-6000/9000 avec le RPi

source: Make sure the Linux I2C driver is enabled and the baud rate is set to 400000 (see [Enabling I2C](RPi_microcontroller.md#optional-enabling-i2c) section for more details). Then, add the following to the printer.cfg:
fr: Assurez-vous que le pilote Linux I2C est activé et que le débit en bauds est défini sur 400 000 (voir la section [Activation d'I2C](RPi_microcontroller.md#optional-enabling-i2c) pour plus de détails). Ensuite, ajoutez ce qui suit au fichier printer.cfg :

source: Configure MPU-6000/9000 series With PICO
fr: Configurer les séries MPU-6000/9000 avec le PICO

source: PICO I2C is set to 400000 on default. Simply add the following to the printer.cfg:
fr: Sur le PICO I2C est réglé sur 400000 par défaut. Ajoutez simplement ce qui suit au fichier printer.cfg :

source: **If you are using MPU-6000/9000 series accelerometer and it show up as `mpu-unknown`, use with caution! They are probably refurbished chips!**
fr: **Si vous utilisez un accéléromètre de la série MPU-6000/9000 et qu'il s'affiche comme "mpu-unknown", utilisez-le avec prudence ! Ce sont probablement des puces reconditionnées !**

source: An ethernet cable with shielded twisted pairs (cat5e or better) is recommended for signal integrity over a long distance. If you still experience signal integrity issues (SPI/I2C errors), shorten the cable.
fr: Un câble Ethernet à paires torsadées blindées (cat5e ou supérieur) est recommandé pour l'intégrité du signal sur une longue distance. Si vous rencontrez toujours des problèmes d'intégrité du signal (erreurs SPI/I2C), raccourcissez le câble.

source: Direct to Raspberry Pi
fr: Directement sur Raspberry Pi

source: **Note: Many MCUs will work with an ADXL345 in SPI mode(eg Pi Pico), wiring and configuration will vary according to your specific board and available pins.**
fr: **Remarque : de nombreux microcontrôleurs fonctionnent avec un ADXL345 en mode SPI (par exemple, Pi Pico), le câblage et la configuration varient en fonction de votre carte spécifique et des broches disponibles.**

source: 3.3V DC power
fr: Alimentation 3,3 V CC

source: Using Raspberry Pi Pico
fr: Utilisation d'un Raspberry Pi Pico

source: You may connect the ADXL345 to your Raspberry Pi Pico and then connect the Pico to your Raspberry Pi via USB. This makes it easy to reuse the accelerometer on other Klipper devices, as you can connect via USB instead of GPIO. The Pico does not have much processing power, so make sure it is only running the accelerometer and not performing any other duties.
fr: Vous pouvez connecter l'ADXL345 à votre Raspberry Pi Pico, puis connecter le Pico à votre Raspberry Pi via USB. Cela facilite la réutilisation de l'accéléromètre sur d'autres appareils Klipper, car vous pouvez vous connecter via USB au lieu de GPIO. Le Pico n'a pas beaucoup de puissance de traitement, alors assurez-vous qu'il n'exécute que l'accéléromètre et n'effectue aucune autre tâche.

source: In order to avoid damage to your RPi make sure to connect the ADXL345 to 3.3V only. Depending on the board's layout, a level shifter may be present, which makes 5V dangerous for your RPi.
fr: Afin d'éviter d'endommager votre RPi, assurez-vous de connecter l'ADXL345 uniquement à 3,3 V. Selon la disposition de la carte, un décalage de niveau peut être présent, ce qui rend le 5V dangereux pour votre RPi.

source: Pico pin
fr: Broche pico

source: Pico pin name
fr: Nom de la broche Pico

source: Wiring diagrams for some of the ADXL345 boards:
fr: Schémas de câblage pour certaines des cartes ADXL345 :

source: Configure ADXL345 With Pi Pico
fr: Configurer ADXL345 avec Pi Pico

source: Flash the Pico Firmware
fr: Flash micrologiciel du Pico

source: On your Raspberry Pi, compile the firmware for the Pico.
fr: Sur votre Raspberry Pi, compilez le firmware du Pico.

source: Now, while holding down the `BOOTSEL` button on the Pico, connect the Pico to the Raspberry Pi via USB. Compile and flash the firmware.
fr: Maintenant, tout en maintenant enfoncé le bouton `BOOTSEL` sur le Pico, connectez le Pico au Raspberry Pi via USB. Compilez et flashez le firmware.

source: If that fails, you will be told which `FLASH_DEVICE` to use. In this example, that's `make flash FLASH_DEVICE=2e8a:0003`. ![Determine flash device](img/flash_rp2040_FLASH_DEVICE.png)
fr: Si cela échoue, on vous indiquera quel `FLASH_DEVICE` utiliser. Dans cet exemple, c'est `make flash FLASH_DEVICE=2e8a:0003`. ![Déterminer le périphérique flash](img/flash_rp2040_FLASH_DEVICE.png)

source: Configure the Connection
fr: Configurer la connexion

source: The Pico will now reboot with the new firmware and should show up as a serial device. Find the pico serial device with `ls /dev/serial/by-id/*`. You can now add an `adxl.cfg` file with the following settings:
fr: Le Pico va maintenant redémarrer avec le nouveau micrologiciel et devrait apparaître comme un périphérique série. Trouvez le périphérique série pico avec `ls /dev/serial/by-id/*`. Vous pouvez maintenant ajouter un fichier `adxl.cfg` avec les paramètres suivants :

source: [mcu adxl] # Change <mySerial> to whatever you found above. For example, # usb-Klipper_rp2040_E661640843545B2E-if00 serial: /dev/serial/by-id/usb-Klipper_rp2040_<mySerial> [adxl345] cs_pin: adxl:gpio1 spi_bus: spi0a axes_map: x,z,y [resonance_tester] accel_chip: adxl345 probe_points: # Somewhere slightly above the middle of your print bed 147,154, 20 [output_pin power_mode] # Improve power stability pin: adxl:gpio23
fr: [mcu adxl] # Changez <mySerial> par ce que vous aurez trouvé ci-dessus. Par exemple, # usb-Klipper_rp2040_E661640843545B2E-if00 serial: /dev/serial/by-id/usb-Klipper_rp2040_<mySerial> [adxl345] cs_pin: adxl:gpio1 spi_bus: spi0a axes_map: x,z,y [resonance_tester] accel_chip: adxl345 probe_points: # Approximativement au milieu du plateau 147,154, 20 [output_pin power_mode] # Pour améliorer la stabilité de l'alimentation pin: adxl:gpio23

source: If setting up the ADXL345 configuration in a separate file, as shown above, you'll also want to modify your `printer.cfg` file to include this:
fr: Si vous mettez la configuration ADXL345 dans un fichier séparé, comme indiqué ci-dessus, vous devrez également modifier votre fichier `printer.cfg` pour inclure ceci :

source: [include adxl.cfg] # Comment this out when you disconnect the accelerometer
fr: [include adxl.cfg] # Commentez cette ligne lorsque vous déconnectez l'accéléromètre

source: [mcu pico] serial: /dev/serial/by-id/<your PICO's serial ID> [mpu9250] i2c_mcu: pico i2c_bus: i2c0a [resonance_tester] accel_chip: mpu9250 probe_points: 100, 100, 20 # an example [static_digital_output pico_3V3pwm] # Improve power stability pin: pico:gpio23
fr: [mcu pico] serial: /dev/serial/by-id/<your PICO's serial ID> [mpu9250] i2c_mcu: pico i2c_bus: i2c0a [resonance_tester] accel_chip: mpu9250 probe_points: 100, 100, 20 # ces coordonées sont juste un exemple [static_digital_output pico_3V3pwm] # Amélioration de la stabilité de l'alimentation pin: pico:gpio23
