Repository: lanmgjy/klipper-translations
Catalog: locales/*/LC_MESSAGES/Measuring_Resonances.po
Languages: fr

source: If you get an error like `Invalid adxl345 id (got xx vs e5)`, where `xx` is some other ID, immediately try again. There's an issue with SPI initialization. If you still get an error, it is indicative of the connection problem with ADXL345, or the faulty sensor. Double-check the power, the wiring (that it matches the schematics, no wire is broken or loose, etc.), and soldering quality.
fr: Si vous obtenez une erreur comme `ID adxl345 non valide (got xx vs e5)`, où `xx` est un autre ID, réessayez immédiatement. Il y a un problème avec l'initialisation SPI. Si vous obtenez toujours une erreur, cela indique un problème de connexion avec ADXL345 ou le capteur défectueux. Vérifiez à nouveau l'alimentation, le câblage (qu'il corresponde aux schémas, qu'aucun fil n'est cassé ou desserré, etc.) et la qualité de la soudure.

source: Note that alternatively you can run the input shaper auto-calibration from Klipper [directly](#input-shaper-auto-calibration), which can be convenient, for example, for the input shaper [re-calibration](#input-shaper-re-calibration).
fr: Notez que vous pouvez également exécuter l'auto-calibration du shaper d'entrée à partir de Klipper [directement](#input-shaper-auto-calibration), ce qui peut être pratique, par exemple, pour le shaper d'entrée [re-calibration](#input-shaper-re-calibration).

source: **Warning!** It is not advisable to run the shaper auto-calibration very frequently (e.g. before every print, or every day). In order to determine resonance frequencies, auto-calibration creates intensive vibrations on each of the axes. Generally, 3D printers are not designed to withstand a prolonged exposure to vibrations near the resonance frequencies. Doing so may increase wear of the printer components and reduce their lifespan. There is also an increased risk of some parts unscrewing or becoming loose. Always check that all parts of the printer (including the ones that may normally not move) are securely fixed in place after each auto-tuning.
fr: **Attention !** Il n'est pas conseillé d'exécuter l'auto-calibrage du shaper trop fréquemment (par exemple, avant chaque impression ou tous les jours). Afin de déterminer les fréquences de résonance, l'auto-calibrage crée des vibrations intenses sur chacun des axes. Généralement, les imprimantes 3D ne sont pas conçues pour résister à une exposition prolongée à des vibrations proches des fréquences de résonance. Cela pourrait augmenter l'usure des composants de l'imprimante et réduire leur durée de vie. Il existe également un risque accru que certaines pièces se dévissent ou se desserrent. Vérifiez toujours que toutes les pièces de l'imprimante (y compris celles qui ne peuvent normalement pas bouger) sont solidement fixées en place après chaque réglage automatique.
